PaymentCreateAllISPC/results/20211007/BMPaymentV21/PAYCTFORDOMOUPNPWOA_1.8_Approve20211007153551662.txt

Status: PASS
Time Taken: 728
Size: 2499
Timestamp: Thu Oct 07 15:35:50 IST 2021
TestStep: Approve

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPaymentStatusUpdate_V1_5
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 2122
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v21" xmlns:urn="urn:pins.payment.evry.com:ws:paymentstatusupdate:v1_5" xmlns:urn1="urn:pins.payment.evry.com:domain:payment-status-update:v1_5">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>paymentAuthorizationCreate</wsc:Function>
         <wsc:Version>1.0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>55057203187</wsc:userid>
            <wsc:credentials>03111012010400425kbKcJMZoMF56OVtVL1neI9CfuAtjCBO603eS0IgWm1WWIO7EfpSL4DE/lDFi69n1sSaabKNt2t+xJppso23a37EmmmyjbdrfF3M0FKxtlD/HJbEkbc46/BMCstNp869esSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu3EfQIWD5xMfslE2lt0gldZQIyIMvAwCMo=Owe13MJu4QRF5Vj5fdm42aK3nL6InZ7iUXQ2d3QvsDlp4SRrFo03WNE0BwBvlyk3Y5tHWP+DVGwZTtsKKiL4yr1VcsAzMmjub6dAdZ8J2NSTeOl14BcfV4hHDqgvdtQ6wTLSNlDSmdoQHUgDHgLgF/oRUnWDutHal9uw/ZEemPI=</wsc:credentials>
            <wsc:channel>BES</wsc:channel>
            <wsc:orgid>2544</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>2544</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>55057203187</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item key="TppId" value="1"/>
            <wsc:item key="TppName" value="ABC"/>
            <wsc:item key="PaymentChannel" value="BES"/>
            <wsc:item key="LogRef" value="2544bank"/>
            <wsc:item key="AgreementId" value="55057203187"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentApproveRequest>
         <urn:transactionInput>
            <!--1 or more repetitions:-->
            <urn1:transactionId>260897252</urn1:transactionId>
         </urn:transactionInput>
      </urn:PaymentApproveRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 55057203187;2544;55057203187;EVRYCPS;PIN;PINSPaymentStatusUpdate_V1_5.PaymentApprove;-;2544bank;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns3:PaymentApproveResponse xmlns:ns7="urn:pins.payment.evry.com:domain:sepa-complex-types:v7" xmlns:ns6="urn:srv.pays.payment.fs.evry.com:ws:agreementcapture:v1_0" xmlns:ns5="urn:srv.stord.fs.evry.com:domain:common:v1" xmlns:ns4="urn:pays.payment.edb.com:domain:edb-types:v1" xmlns:ns3="urn:pins.payment.evry.com:ws:paymentstatusupdate:v1_5" xmlns:ns2="urn:pins.payment.evry.com:domain:payment-status-update:v1_5" xmlns="http://edb.com/ws/WSCommon_v21">
         <ns4:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <StrErrorCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <Message>OK</Message>
            <NativeError xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
         </ns4:ResponseState>
         <ns3:paymentStatusUpdateSummary>
            <ns2:paymentStatus>READY_FOR_DUE_DATE</ns2:paymentStatus>
            <ns2:errorCode>0</ns2:errorCode>
            <ns2:severity>0</ns2:severity>
            <ns2:message>OK</ns2:message>
            <ns2:numberOfTransactions>1</ns2:numberOfTransactions>
         </ns3:paymentStatusUpdateSummary>
         <ns3:paymentStatusUpdateResult>
            <ns2:messageId>1025837</ns2:messageId>
            <ns2:paymentInfoId>1119286</ns2:paymentInfoId>
            <ns2:transactionId>260897252</ns2:transactionId>
            <ns2:paymentStatus>READY_FOR_DUE_DATE</ns2:paymentStatus>
            <ns2:errorCode>0</ns2:errorCode>
            <ns2:severity>0</ns2:severity>
            <ns2:message>OK</ns2:message>
         </ns3:paymentStatusUpdateResult>
         <ns3:approvalInformation>
            <ns2:controlSum>100</ns2:controlSum>
            <ns2:accumulatedAmountBaseCurrency>
               <ns7:accumulatedAmount currency="NOK">
                  <ns7:amount>100</ns7:amount>
               </ns7:accumulatedAmount>
            </ns2:accumulatedAmountBaseCurrency>
            <ns2:accumulatedInstructedAmounts>
               <ns7:accumulatedAmount currency="NOK">
                  <ns7:amount>100.00</ns7:amount>
               </ns7:accumulatedAmount>
            </ns2:accumulatedInstructedAmounts>
            <ns2:accumulatedAccountAmounts>
               <ns2:accountIdentification>36281079039</ns2:accountIdentification>
               <ns2:accumulatedAmountAccountCurrency>
                  <ns7:accumulatedAmount currency="NOK">
                     <ns7:amount>100</ns7:amount>
                  </ns7:accumulatedAmount>
               </ns2:accumulatedAmountAccountCurrency>
            </ns2:accumulatedAccountAmounts>
            <ns2:numberOfTransactionsPerPaymentType>
               <ns2:numberOfTransactions>1</ns2:numberOfTransactions>
               <ns2:paymentType>FOREIGN_DOMESTIC_WITHOUT_ADVICE_OUT</ns2:paymentType>
            </ns2:numberOfTransactionsPerPaymentType>
         </ns3:approvalInformation>
      </ns3:PaymentApproveResponse>
   </soap:Body>
</soap:Envelope>
